ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV130/ESP32_WordClockV130.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
 Changes V095: Cleanup code. New function LEDstartup. Webserver to core 1. Loop is again 210,000L/s -> xTaskCreatePinnedToCore(WebServerTask,"WebServerTask", 4096, NULL, 1, NULL, 1 ); 
 Changes V096: Removed ESP32 BLE. Caused restarts in ESP32 3.2.0. NimBLE works fine and probably better.
 Changes V097: Webpage remembers and also shows last small or long menu display
 Changes V098: Cleanup code in ReworkInputString(). Changed if(Mem.WIFIcredentials == SET_AND_OK)  WiFi.reconnect(); in every minute. 
               After power faillure the clock starts faster than a WIFI-router.  .bin upload repaired. Did not upload since V091
 Changes V099: EDSOFT bij 256 LED-klok. Removed: sntp_set_time_sync_notification_cb(NTPnotify); Seems unnecessary. 
 Changes V100: Disconnect for a day and try again to connect WIFI. Added NLM1M2M3M4L161 design.  Filename changed: without Arduino in it
 Changes V101: IS did not recolour per second -> repaired. HTML-Menu appears on time after upload. Added HOURLYHETISWAS with Q7.
 Changes V102: Corrected that every second the time was printed
 Changes V103: M1M2M3M4 clock did not respond to HET IS WAS colouring. Time printing every minute had no linefeed
 Changes V104: If length BLEbroadcastName < 4 fill in the name WordClock. If BLE connection inactive for 15 minutes -> disconnect. Focus back to webpage input field
 Changes V105: Menu optie Q8 is RAINBOW Option Q8 changed to '(' EdSoftLEDSOn and Q9 -> ')' HetIsWasOff in menu as new option
 Changes V106: Fast rainbow added. ~ in menu --> Hourly changing display mode added for demo purposes
 Changes V107: Print DisplayChoice() added.  case '~': Mem.RandomDisplay 1 = per minute or 2= per hour 0 is off 
 Changes V108: Added BLEbroadcastname in webpage title. Bug fix in menu U Demo mode. Runs with Arduino core 2.0.17 en Espressif core 3.3.0
 Changes V109: Option Y Rainbow test operates outside WIFI when entered via webpage
 Changes V110: Use of Mem.WIFIcredentials optimized to restore WIFI connection after power loss 
 Changes V111: Made CheckRestoreWIFIconnectivity(). Removed RAINBOWFAST
 Changes V112: Tested in several clocks
 Changes V113: In Ulrich design Klok No47 --> Shirley Janssen  NLM1M2M3M4L161
 Changes V114: is V113
 Changes V115: Time functions updated. You can compile now By Arduino pin (default)
 Changes V116: Removed redundant code
 Changes V117: Added remote control. 
 Changes V118: OTA more stable. void SetStatusLED() changed to turn of LED completely also in ESP32 core 3
 Changes V119: IR-Remote works. Default Time-zone is entered when ResetCredentials(). IR-remote Power ON/OFF turns ON/OFF clock display 
 Changes V120: Mem.IRremote -> Mem.UseRotary H03. H001 and H002 -> H01 and H02. in wtekstAppend()  if(Mem.MCUrestarted == 0) Tekstprint(sptext); 
 Changes V121: Optimized IR-remote. Use Power button to use IR-remote input for 2 minutes
 Changes V122: Optimized SetDS3231Time()  if(DS3231Installed)   SetDS3231Time(); Removed stray input from IRremote and added ONOFF
 Changes V123: For colour input, option F in menu, decimal input 0-9 is possible. F0900 = 0x00FF0000 = red 
 Changes V124: Failed to Improved WIFI reconnection after power failure
 Changes V125: Improved WIFI reconnection after power failure. Removed in EveryMinuteUpdate(void) CheckRestoreWIFIconnectivity();  Not neccesarry. Using configTime(); for NTP 
 Changes V126: Placed setTimezone(); after configTime(..);. If DS3231 on --> BUILTIN LED13 Off.  Cosmetic changes
 Changes V127: Replaced  ESP.getFreeSketchSpace() with UPDATE_SIZE_UNKNOWN Added disableCore0WDT() and disableCore1WDT() during upload
               Added WiFi.setSleep(WIFI_PS_NONE) before starting server. Re-enabled watchdogs after upload completes or fails
 Changes V128: Using <ESPAsyncWebServer.h>. Better to use when uploading bin files > 1 Mb
 Changes V129: Using Neopixel. Optimized code so option T LEDtest runs again from the web page if (inputMessage.equalsIgnoreCase("Y") ) OptionYRainbow = true; etc.
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000

 If remote is off and turned on --> restart ESP32
 Power ON/OFF start entering time. Switch to DS3231
 OK leaves learning mode. No action anymore from remote entries
 Learning mode only from BLE or serial


*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)   
               By GPIO number (legacy).     -- > When using NEOpixel change 
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

